Podkova/src/AccumulationRegisters/ЗаявкиНаВозвратТоваровОтКлиентов/ЗаявкиНаВозвратТоваровОтКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаявкиНаВозвратТоваровОтКлиентов</name>
  <resources>
    <name>Заявлено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаявкаНаВозвратТоваровОтКлиента</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Podkova/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes>
    <name>Безразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейныеРазмерыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <type>
      <types>CatalogRef.СкладскиеГруппыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.ТипоразмерыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

Podkova/src/AccumulationRegisters/ЗаявкиНаВозвратТоваровОтКлиентов/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Или Не ПроведениеСерверУТ.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	БлокироватьДляИзменения = Истина;

	// Текущее состояние набора помещается во временную таблицу "ДвиженияЗаявкиНаВозвратТоваровОтКлиентовПередЗаписью",
	// чтобы при записи получить изменение нового набора относительно текущего.

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ЭтоНовый",    ДополнительныеСвойства.ЭтоНовый);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозвратТоваровОтКлиента,
	|	Таблица.Номенклатура                    КАК Номенклатура,
	|	Таблица.Характеристика                  КАК Характеристика,
	|	Таблица.Договор                         КАК Договор,
	|	Таблица.КодСтроки                       КАК КодСтроки,
	|	ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			Таблица.КОформлению
	|		ИНАЧЕ
	|			-Таблица.КОформлению
	|	КОНЕЦ                   КАК КОформлениюПередЗаписью
	|ПОМЕСТИТЬ ДвиженияЗаявкиНаВозвратТоваровОтКлиентовПередЗаписью
	|ИЗ
	|	РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов КАК Таблица
	|ГДЕ
	|	Таблица.Регистратор = &Регистратор
	|	И НЕ &ЭтоНовый
	|";
	Запрос.Выполнить();

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ОбменДанными.Загрузка Или Не ПроведениеСерверУТ.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;

	ИспользоватьДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров =
		ПолучитьФункциональнуюОпцию("ИспользоватьДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров");
	
	ФормироватьСводнуюТаблицу = ДополнительныеСвойства.Свойство("ФормироватьСводнуюТаблицуЗаявкиНаВозврат");
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ФормироватьСводнуюТаблицу", ФормироватьСводнуюТаблицу);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозвратТоваровОтКлиента,
	|	ТаблицаИзменений.Номенклатура                    КАК Номенклатура,
	|	ТаблицаИзменений.Характеристика                  КАК Характеристика,
	|	ТаблицаИзменений.Договор                         КАК Договор,
	|	ТаблицаИзменений.КодСтроки                       КАК КодСтроки,
	|	СУММА(ТаблицаИзменений.КОформлениюИзменение)     КАК КОформлениюИзменение
	|ПОМЕСТИТЬ ДвиженияЗаявкиНаВозвратТоваровОтКлиентовИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозвратТоваровОтКлиента,
	|		Таблица.Номенклатура                    КАК Номенклатура,
	|		Таблица.Характеристика                  КАК Характеристика,
	|		Таблица.Договор                         КАК Договор,
	|		Таблица.КодСтроки                       КАК КодСтроки,
	|		Таблица.КОформлениюПередЗаписью         КАК КОформлениюИзменение
	|	ИЗ
	|		ДвиженияЗаявкиНаВозвратТоваровОтКлиентовПередЗаписью КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозвратТоваровОтКлиента,
	|		Таблица.Номенклатура                    КАК Номенклатура,
	|		Таблица.Характеристика                  КАК Характеристика,
	|		Таблица.Договор                         КАК Договор,
	|		Таблица.КодСтроки                       КАК КодСтроки,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				-Таблица.КОформлению
	|			ИНАЧЕ
	|				Таблица.КОформлению
	|		КОНЕЦ                          КАК КОформлениюИзменение
	|	ИЗ
	|		РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов КАК Таблица
	|	ГДЕ
	|		Таблица.Регистратор = &Регистратор) КАК ТаблицаИзменений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.ЗаявкаНаВозвратТоваровОтКлиента,
	|	ТаблицаИзменений.Номенклатура,
	|	ТаблицаИзменений.Характеристика,
	|	ТаблицаИзменений.Договор,
	|	ТаблицаИзменений.КодСтроки
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаИзменений.КОформлениюИзменение) <> 0
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаИзменений.Номенклатура                    КАК Номенклатура,
	|	ТаблицаИзменений.Характеристика                  КАК Характеристика,
	|	ТаблицаИзменений.Договор                         КАК Договор,
	|	СУММА(ТаблицаИзменений.КОформлениюИзменение)     КАК КоличествоИзменение
	|ПОМЕСТИТЬ ДвиженияЗаявкиНаВозвратТоваровОтКлиентовИзменениеСводно
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Номенклатура                    КАК Номенклатура,
	|		Таблица.Характеристика                  КАК Характеристика,
	|		Таблица.Договор                         КАК Договор,
	|		Таблица.КОформлениюПередЗаписью         КАК КОформлениюИзменение
	|	ИЗ
	|		ДвиженияЗаявкиНаВозвратТоваровОтКлиентовПередЗаписью КАК Таблица
	|	ГДЕ
	|		&ФормироватьСводнуюТаблицу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Номенклатура                    КАК Номенклатура,
	|		Таблица.Характеристика                  КАК Характеристика,
	|		Таблица.Договор                         КАК Договор,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				-Таблица.КОформлению
	|			ИНАЧЕ
	|				Таблица.КОформлению
	|		КОНЕЦ                          КАК КОформлениюИзменение
	|	ИЗ
	|		РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов КАК Таблица
	|	ГДЕ
	|		Таблица.Регистратор = &Регистратор
	|		И &ФормироватьСводнуюТаблицу) КАК ТаблицаИзменений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.Номенклатура,
	|	ТаблицаИзменений.Характеристика,
	|	ТаблицаИзменений.Договор
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаИзменений.КОформлениюИзменение) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Договор
	|
	|;
	|УНИЧТОЖИТЬ ДвиженияЗаявкиНаВозвратТоваровОтКлиентовПередЗаписью
	|";
	
	ЗапросПакет = Запрос.ВыполнитьПакет();
	Выборка = ЗапросПакет[0].Выбрать();
	Выборка.Следующий();
	// Новые изменения были помещены во временную таблицу "ДвиженияЗаявкиНаВозвратТоваровОтКлиентовИзменение".
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияЗаявкиНаВозвратТоваровОтКлиентовИзменение", Выборка.Количество > 0);
	
	Выборка = ЗапросПакет[1].Выбрать();
	Выборка.Следующий();
	СтруктураВременныеТаблицы.Вставить("ДвиженияЗаявкиНаВозвратТоваровОтКлиентовИзменениеСводно", Выборка.Количество > 0);
	
	Если ИспользоватьДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров Тогда
		
		Регистратор = Отбор.Регистратор.Значение;
		
		СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
		
		Если СтруктураВременныеТаблицы.ДвиженияЗаявкиНаВозвратТоваровОтКлиентовИзменение Тогда
		
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров",
				Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить());
			Запрос.УстановитьПараметр("МерныеТипыЕдиницИзмерений",
				Справочники.УпаковкиЕдиницыИзмерения.МерныеТипыЕдиницИзмерений());
			Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
			
			ТекстЗапроса = "
			|ВЫБРАТЬ
			|	Таблица.ЗаявкаНаВозвратТоваровОтКлиента,
			|	Таблица.Номенклатура,
			|	Таблица.Характеристика,
			|	Таблица.Договор
			|ПОМЕСТИТЬ ДвиженияЗаявкиНаВозвратТоваровОтКлиентовИзменениеМерныеТовары
			|ИЗ
			|	ДвиженияЗаявкиНаВозвратТоваровОтКлиентовИзменение КАК Таблица
			|ГДЕ 
			|	Таблица.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
			|СГРУППИРОВАТЬ ПО
			|	Таблица.ЗаявкаНаВозвратТоваровОтКлиента,
			|	Таблица.Номенклатура,
			|	Таблица.Характеристика,
			|	Таблица.Договор
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
			// Основная таблица
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ
			|	ЗаявкиНаВозвратТоваровОтКлиентов.ВидДвижения                      КАК ВидДвижения,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.ЗаявкаНаВозвратТоваровОтКлиента  КАК ЗаявкаНаВозвратТоваровОтКлиента,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.Номенклатура                     КАК Номенклатура,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.Характеристика                   КАК Характеристика,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.Договор                          КАК Договор,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.КОформлению                      КАК КОформлению
			|ПОМЕСТИТЬ ВТЗаявкиНаВозвратТоваровОтКлиентов
			|ИЗ
			|	РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов КАК ЗаявкиНаВозвратТоваровОтКлиентов
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|		ДвиженияЗаявкиНаВозвратТоваровОтКлиентовИзменение КАК Изменения
			|		ПО ЗаявкиНаВозвратТоваровОтКлиентов.ЗаявкаНаВозвратТоваровОтКлиента = Изменения.ЗаявкаНаВозвратТоваровОтКлиента
			|			И ЗаявкиНаВозвратТоваровОтКлиентов.Номенклатура                  = Изменения.Номенклатура
			|			И ЗаявкиНаВозвратТоваровОтКлиентов.Характеристика                = Изменения.Характеристика
			|			И ЗаявкиНаВозвратТоваровОтКлиентов.Договор                       = Изменения.Договор
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
			// Допустимые отклонения
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ
			|	ЗаявкиНаВозвратТоваровОтКлиентов.ЗаявкаНаВозвратТоваровОтКлиента  КАК ЗаявкаНаВозвратТоваровОтКлиента,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.Номенклатура                     КАК Номенклатура,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.Характеристика                   КАК Характеристика,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.Договор                          КАК Договор,
			|	СУММА(ЗаявкиНаВозвратТоваровОтКлиентов.КОформлению
			|		* (&ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100)) КАК ДопустимоеОтклонение
			|ПОМЕСТИТЬ ВТДопустимыеОтклоненияЗаявкиНаВозвратТоваровОтКлиентов
			|ИЗ
			|	ВТЗаявкиНаВозвратТоваровОтКлиентов КАК ЗаявкиНаВозвратТоваровОтКлиентов
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|		ДвиженияЗаявкиНаВозвратТоваровОтКлиентовИзменениеМерныеТовары КАК Изменения
			|		ПО ЗаявкиНаВозвратТоваровОтКлиентов.ЗаявкаНаВозвратТоваровОтКлиента = Изменения.ЗаявкаНаВозвратТоваровОтКлиента
			|			И ЗаявкиНаВозвратТоваровОтКлиентов.Номенклатура                  = Изменения.Номенклатура
			|			И ЗаявкиНаВозвратТоваровОтКлиентов.Характеристика                = Изменения.Характеристика
			|ГДЕ
			|	ЗаявкиНаВозвратТоваровОтКлиентов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|СГРУППИРОВАТЬ ПО
			|	ЗаявкиНаВозвратТоваровОтКлиентов.ЗаявкаНаВозвратТоваровОтКлиента,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.Номенклатура,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.Характеристика,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.Договор
			|ИНДЕКСИРОВАТЬ ПО
			|	ЗаявкаНаВозвратТоваровОтКлиента,
			|	Номенклатура,
			|	Характеристика,
			|	Договор
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
			//Остатки
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ
			|	ЗаявкиНаВозвратТоваровОтКлиентов.ЗаявкаНаВозвратТоваровОтКлиента  КАК ЗаявкаНаВозвратТоваровОтКлиента,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.Номенклатура                     КАК Номенклатура,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.Характеристика                   КАК Характеристика,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.Договор                          КАК Договор,
			|	СУММА(ВЫБОР КОГДА ЗаявкиНаВозвратТоваровОтКлиентов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
			|			ЗаявкиНаВозвратТоваровОтКлиентов.КОформлению
			|		ИНАЧЕ
			|			-ЗаявкиНаВозвратТоваровОтКлиентов.КОформлению
			|	КОНЕЦ)                                                            КАК КОформлениюОстаток
			|ПОМЕСТИТЬ ВТЗаявкиНаВозвратТоваровОтКлиентовОстатки
			|ИЗ
			|	ВТЗаявкиНаВозвратТоваровОтКлиентов КАК ЗаявкиНаВозвратТоваровОтКлиентов
			|СГРУППИРОВАТЬ ПО
			|	ЗаявкиНаВозвратТоваровОтКлиентов.ЗаявкаНаВозвратТоваровОтКлиента,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.Номенклатура,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.Характеристика,
			|	ЗаявкиНаВозвратТоваровОтКлиентов.Договор
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗаказыОстатки.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозвратТоваровОтКлиента
			|ИЗ
			|	ВТЗаявкиНаВозвратТоваровОтКлиентовОстатки КАК ЗаказыОстатки
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|		ВТДопустимыеОтклоненияЗаявкиНаВозвратТоваровОтКлиентов КАК ДопустимыеОтклонения
			|		ПО
			|			ЗаказыОстатки.ЗаявкаНаВозвратТоваровОтКлиента  = ДопустимыеОтклонения.ЗаявкаНаВозвратТоваровОтКлиента
			|			И ЗаказыОстатки.Номенклатура                   = ДопустимыеОтклонения.Номенклатура
			|			И ЗаказыОстатки.Характеристика                 = ДопустимыеОтклонения.Характеристика
			|ГДЕ
			|	ЗаказыОстатки.КОформлениюОстаток <= ДопустимыеОтклонения.ДопустимоеОтклонение
			|	И ЗаказыОстатки.КОформлениюОстаток >= -ДопустимыеОтклонения.ДопустимоеОтклонение
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
			Запрос.Текст = ТекстЗапроса;
			
			ВыборкаЗаказ = Запрос.Выполнить().Выбрать();
			
			Пока ВыборкаЗаказ.Следующий() Цикл
				
				РегистрыСведений.ОчередьЗаказовККорректировкеСтрокМерныхТоваров.ДобавитьЗаказВОчередь(
					ВыборкаЗаказ.ЗаявкаНаВозвратТоваровОтКлиента);
				
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
